---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsCriticalPath
source: html/36768112-4250-51dd-16b6-ecbc4db55f4e.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.IsCriticalPath Property

Verifies if the segment is on the critical path.

## Syntax (C#)
```csharp
public bool IsCriticalPath { get; }
```